noisysouth/adaradio/rp2040_windw_adaradio/rp2040_windw_adaradio.ino
/**************************************************************************
  Check out the links for tutorials and wiring diagrams.

  Adafruit invests time and resources providing this open source code,
  please support Adafruit and open-source hardware by purchasing
  products from Adafruit!

  Written by Limor Fried/Ladyada for Adafruit Industries.
  MIT license, all text above must be included in any redistribution
 **************************************************************************/
//#define ESP32_S3_TFT // for ESP32-S3 TFT
#define HX8357 // for the Adafruit 3.5" TFT (HX8357) FeatherWing

#include <Adafruit_GFX.h>    // Core graphics library
#ifdef ESP32_S3_TFT
  // This is a library for several Adafruit displays based on ST77* drivers.
  // Works with the Adafruit TFT Gizmo
  // ----> http://www.adafruit.com/products/4367
  #include <Adafruit_ST7789.h> // Hardware-specific library for ST7789 // on ESP32-S3 TFT
#endif
#ifdef HX8357
  // This is our library for the Adafruit 3.5" TFT (HX8357) FeatherWing
  // ----> http://www.adafruit.com/products/3651
  #include "Adafruit_HX8357.h" // on 3.5" TFT (HX8357) FeatherWing

  // If using the rev 1 with STMPE resistive touch screen controller uncomment this line:
  //#include <Adafruit_STMPE610.h>
  // If using the rev 2 with TSC2007, uncomment this line:
  #include <Adafruit_TSC2007.h>
#endif

#include <SPI.h>
#include <Wire.h> // for i2c keyboard, DRV2605 haptic feedback, FM RDS transmitter

#include <Adafruit_Si4713.h> // for FM RDS transmitter
#define _BV(n) (1 << n)

#include "Adafruit_seesaw.h" // mini gamepad (on STEMMA QT)

#ifdef USE_MP3
  #include <Adafruit_VS1053.h> // for mp3 playing from microSD card; wants same pins as (HX8357) 3.5" sTFT? (5, 6, 9, 10)
#endif

#include "Adafruit_DRV2605.h" // haptic

Adafruit_DRV2605 drv; // haptic

//#define DEBUG_BUTTONS
// ------------------------- FM RDS transmitter ----------------------
#define FM_RESETPIN 13 // wired to a different pin than intended (wanted 12)
//#define FM_RESETPIN 12
//#define FM_RESETPIN 5

Adafruit_Si4713 radio = Adafruit_Si4713(FM_RESETPIN);
uint16_t fm_station_freq = 10230; // 102.30 MHz
//#define DEBUG_FM

// ------------------------- TFT setup -------------------------

#ifdef ESP32_S3_TFT
  // Use dedicated hardware SPI pins
  Adafruit_ST7789 tft = Adafruit_ST7789(TFT_CS, TFT_DC, TFT_RST);

  // on ESP32-S3 TFT
  #define PIXELS_X 240
  #define PIXELS_Y 135
#endif

#ifdef HX8357
  #ifdef ESP8266
    #define STMPE_CS 16
    #define TFT_CS   0
    #define TFT_DC   15
    #define SD_CS    2
  #elif defined(ESP32) && !defined(ARDUINO_ADAFRUIT_FEATHER_ESP32S2) && !defined(ARDUINO_ADAFRUIT_FEATHER_ESP32S3)
    #define STMPE_CS 32
    #define TFT_CS   15
    #define TFT_DC   33
    #define SD_CS    14
  #elif defined(TEENSYDUINO)
    #define TFT_DC   10
    #define TFT_CS   4
    #define STMPE_CS 3
    #define SD_CS    8
  #elif defined(ARDUINO_STM32_FEATHER)
    #define TFT_DC   PB4
    #define TFT_CS   PA15
    #define STMPE_CS PC7
    #define SD_CS    PC5
  #elif defined(ARDUINO_NRF52832_FEATHER)  /* BSP 0.6.5 and higher! */
    #define TFT_DC   11
    #define TFT_CS   31
    #define STMPE_CS 30
    #define SD_CS    27
  #elif defined(ARDUINO_MAX32620FTHR) || defined(ARDUINO_MAX32630FTHR)
    #define TFT_DC   P5_4
    #define TFT_CS   P5_3
    #define STMPE_CS P3_3
    #define SD_CS    P3_2
  #else
      // Anything else, defaults!
    #define STMPE_CS 6
    #define TFT_CS   9
    #define TFT_DC   10
    #define SD_CS    5
  #endif

  #define TFT_RST -1

  // Use hardware SPI and the above for CS/DC
  Adafruit_HX8357 tft = Adafruit_HX8357(TFT_CS, TFT_DC, TFT_RST);

// --------------------- touchscreen setup ---------------------

  #if defined(_ADAFRUIT_STMPE610H_)
    Adafruit_STMPE610 ts = Adafruit_STMPE610(STMPE_CS);
  #elif defined(_ADAFRUIT_TSC2007_H)
    // If you're using the TSC2007 there is no CS pin needed, so instead its an IRQ!
    #define TSC_IRQ STMPE_CS
    Adafruit_TSC2007 ts = Adafruit_TSC2007();             // newer rev 2 touch contoller
  #else
    #error("You must have either STMPE or TSC2007 headers included!")
  #endif

  // This is calibration data for the raw touch data to the screen coordinates
  // For STMPE811/STMPE610
  #define STMPE_TS_MINX 3800
  #define STMPE_TS_MAXX 100
  #define STMPE_TS_MINY 100
  #define STMPE_TS_MAXY 3750
  // For TSC2007
  #define TSC_TS_MINX 300
  #define TSC_TS_MAXX 3800
  #define TSC_TS_MINY 185
  #define TSC_TS_MAXY 3700
  // set during setup(); use during loop()
  int16_t touch_minx, touch_maxx;
  int16_t touch_miny, touch_maxy;
#endif

// --------------------- colors ------------------------

enum color_e {
#ifdef ESP32_S3_TFT
  color_black = ST77XX_BLACK,
  color_white = ST77XX_WHITE,
  color_blue = ST77XX_BLUE,
  color_green = ST77XX_GREEN,
  color_yellow = ST77XX_YELLOW,
  color_red = ST77XX_RED,
  color_magenta = ST77XX_MAGENTA,
#endif
#ifdef HX8357
  color_black = HX8357_BLACK,
  color_white = HX8357_WHITE,
  color_blue = HX8357_BLUE,
  color_green = HX8357_GREEN,
  color_yellow = HX8357_YELLOW,
  color_red = HX8357_RED,
  color_magenta = HX8357_MAGENTA,
#endif
  // raw 565 format colors:
  // Source: https://github.com/newdigate/rgb565_colors/tree/main?tab=readme-ov-file#gray
  color_silver = 0xbdf7,
  //color_lt_gray = 0x6B4D, // dim gray 
  color_lt_gray = 0xd69a,
  color_dk_gray = 0x29A7, // gunmetal gray

  color_backgr = color_black,
  color_highlight = color_silver, // color_white,
  //color_shadow = 0x328A, // dark slate gray
  color_shadow = color_dk_gray,
  color_window = color_lt_gray,

  color_cap_shadow = color_black,
  color_cap_bar = color_shadow,
  color_cap_label = color_white,

  color_wndw_text = color_black,
  color_btn_text = color_black,
  color_edit_text = color_black,
  color_edit_backgr = color_white,
  color_edit_cursor = color_black,

  color_label_text = color_black,
  color_label_backgr = color_window,

  color_focus_border = color_black,

  color_count,
};

// --------------------- input ------------------------

