noisysouth/adaradio/rp2040_windw_adaradio/rp2040_windw_adaradio.ino
// on-board digital input button
#define PIN_BOOT_BUTTON  0 // on ESP32 S3 TFT

// mini gamepad (on STEMMA QT)
Adafruit_seesaw ss;
#define BUTTON_X         6
#define BUTTON_Y         2
#define BUTTON_A         5
#define BUTTON_B         1
#define BUTTON_SELECT    0
#define BUTTON_START    16
uint32_t button_mask = (1UL << BUTTON_X) | (1UL << BUTTON_Y) | (1UL << BUTTON_START) |
                       (1UL << BUTTON_A) | (1UL << BUTTON_B) | (1UL << BUTTON_SELECT);
//#define IRQ_PIN   5

// ----------------------- mp3 sound output ----------------------------
#ifdef USE_MP3
  // sound module: Adafruit Music Maker FeatherWing
  // (3357 headphone version, or 1788 3W stereo amp version)
  // These are the pins used
  #define VS1053_RESET   -1     // VS1053 reset pin (not used!)

  // Feather ESP8266
  #if defined(ESP8266)
    #define VS1053_CS      16     // VS1053 chip select pin (output)
    #define VS1053_DCS     15     // VS1053 Data/command select pin (output)
    #define CARDCS          2     // Card chip select pin
    #define VS1053_DREQ     0     // VS1053 Data request, ideally an Interrupt pin

  // Feather ESP32
  #elif defined(ESP32) && !defined(ARDUINO_ADAFRUIT_FEATHER_ESP32S2) && !defined(ARDUINO_ADAFRUIT_FEATHER_ESP32S3_TFT)
    #define VS1053_CS      32     // VS1053 chip select pin (output)
    #define VS1053_DCS     33     // VS1053 Data/command select pin (output)
    #define CARDCS         14     // Card chip select pin
    #define VS1053_DREQ    15     // VS1053 Data request, ideally an Interrupt pin

  // Feather Teensy3
  #elif defined(TEENSYDUINO)
    #define VS1053_CS       3     // VS1053 chip select pin (output)
    #define VS1053_DCS     10     // VS1053 Data/command select pin (output)
    #define CARDCS          8     // Card chip select pin
    #define VS1053_DREQ     4     // VS1053 Data request, ideally an Interrupt pin

  // WICED feather
  #elif defined(ARDUINO_STM32_FEATHER)
    #define VS1053_CS       PC7     // VS1053 chip select pin (output)
    #define VS1053_DCS      PB4     // VS1053 Data/command select pin (output)
    #define CARDCS          PC5     // Card chip select pin
    #define VS1053_DREQ     PA15    // VS1053 Data request, ideally an Interrupt pin

  #elif defined(ARDUINO_NRF52832_FEATHER )
    #define VS1053_CS       30     // VS1053 chip select pin (output)
    #define VS1053_DCS      11     // VS1053 Data/command select pin (output)
    #define CARDCS          27     // Card chip select pin
    #define VS1053_DREQ     31     // VS1053 Data request, ideally an Interrupt pin

  // Feather RP2040
  #elif defined(ARDUINO_ADAFRUIT_FEATHER_RP2040)
    #define VS1053_CS       8     // VS1053 chip select pin (output)
    #define VS1053_DCS     10     // VS1053 Data/command select pin (output)
    #define CARDCS          7     // Card chip select pin
    #define VS1053_DREQ     9     // VS1053 Data request, ideally an Interrupt pin

  // Feather M4, M0, 328, ESP32S2, ESP32S3 TFT, nRF52840 or 32u4
  #else
    #define VS1053_CS       6     // VS1053 chip select pin (output)
    #define VS1053_DCS     10     // VS1053 Data/command select pin (output)
    #define CARDCS          5     // Card chip select pin
    // DREQ should be an Int pin *if possible* (not possible on 32u4)
    #define VS1053_DREQ     9     // VS1053 Data request, ideally an Interrupt pin

  #endif

  Adafruit_VS1053_FilePlayer musicPlayer =
    Adafruit_VS1053_FilePlayer(VS1053_RESET, VS1053_CS, VS1053_DCS, VS1053_DREQ, CARDCS);

#endif

// ----------------------- window structures ----------------------------

enum border_style_e {
  border_outset = 0,
  border_ridge,
  border_outset_narrow,
  border_inset,
  border_focus,
  border_style_count,
};

struct windw_s {
	int wx, wy, ww, wh; // Window coords.
	int border_style;		//  enum border_style_e
  int buffered;		    // Flag for buffer.
  GFXcanvas16 *canvas; // 16-bit, width x height pixels
};

#define WINDW_MAX_CAP 61
#define CHAR_WIDTH_PIXELS 12
#define CHAR_HEIGHT_PIXELS 16

struct cap_windw_s {
  struct windw_s windw;
  char label[WINDW_MAX_CAP]; // full cap
};

#define WINDW_MAX_LINE 61

struct cap_twindw_s {
  struct cap_windw_s cwindw;
  char line1[WINDW_MAX_LINE];
  char line2[WINDW_MAX_LINE];
  int button;
};

#define BUTTON_WIDTH_PIXELS  64
#define BUTTON_HEIGHT_PIXELS 32
#define BUTTON_MAX_LABEL 20

struct button_s {
  struct windw_s windw;
  char label_str[BUTTON_MAX_LABEL];
	unsigned hotkey;
	int altkey;
  //GFXcanvas16 canvas(BUTTON_WIDTH_PIXELS, BUTTON_HEIGHT_PIXELS); // 16-bit, width x height pixels
  GFXcanvas16 *label_canvas; // 16-bit, width-4 x height-4 pixels
};

#define EDIT_WIDTH_PIXELS   64
#define EDIT_HEIGHT_PIXELS  32
#define EDIT_MAX_TEXT       WINDW_MAX_LINE
#define CURSOR_BLINK_COUNT  5

struct edit_s {
  struct windw_s windw;
  char text_str[EDIT_MAX_TEXT];
  int text_max_chars;
  int cursor_idx;
  bool cursor_blink_on;
  int  cursor_blink_count;
};

#define LABEL_WIDTH_PIXELS   64
#define LABEL_HEIGHT_PIXELS  32
#define LABEL_MAX_TEXT       WINDW_MAX_LINE

struct label_s {
  struct windw_s windw;
  char text_str[LABEL_MAX_TEXT];
  int text_max_chars;
};

#define LIST_MAX_TEXT   WINDW_MAX_LINE
#define LIST_MAX_ITEMS  100
// TODO: implement
struct list_s {
  struct windw_s windw;
  int scroll_idx;
  int item_count;
  char text_str[LIST_MAX_ITEMS][LIST_MAX_TEXT];
};

enum ctrl_type_e {
  ctrl_type_none = 0,
  ctrl_windw,
  ctrl_cap_windw,
  ctrl_cap_twindw,
  ctrl_button,
  ctrl_up_down, // TODO
  ctrl_edit,
  ctrl_scroll,  // TODO
  ctrl_list,    // TODO
  ctrl_type_count,
};

struct tab_ctrl_s {
  int   ctrl_type; // enum ctrl_type_e
  void *ctrl_obj;
};

#define SCREEN_MAX_CTRLS 10
struct ctrl_screen_s {
  struct tab_ctrl_s screen_ctrls[SCREEN_MAX_CTRLS];
  int               focus_idx;
};

// ----------------------- screen functions: change focus to new control ----------------------------

// Change focus to *next* control in screen structure.
//  If the last control had focus, wrap (change focus to the first control).
void ScreenTabNext(struct ctrl_screen_s *scrn) {
  int ctrl_idx;
  struct tab_ctrl_s *focus_old;
  struct tab_ctrl_s *focus_new;

  focus_old = &scrn->screen_ctrls[scrn->focus_idx];
  DrawCtrl (focus_old, /*has_focus*/false);

  ctrl_idx = 0;
  do {
    if (scrn->screen_ctrls[ctrl_idx].ctrl_type == ctrl_type_none) {
      scrn->focus_idx = 0; // go back to the first control
      break;
    }
    if (ctrl_idx == scrn->focus_idx + 1) {
      scrn->focus_idx = ctrl_idx; // we can go to the next one
      break;
    }
    ctrl_idx++;
  } while (1);

  focus_new = &scrn->screen_ctrls[scrn->focus_idx];
  DrawCtrl (focus_new, /*has_focus*/true);
}

// Change focus to *previous* control in screen structure.
//  If the first control had focus, wrap (change focus to the last control).
void ScreenTabPrev(struct ctrl_screen_s *scrn) {
  struct tab_ctrl_s *focus_old;
  struct tab_ctrl_s *focus_new;

  focus_old = &scrn->screen_ctrls[scrn->focus_idx];
  DrawCtrl (focus_old, /*has_focus*/false);

  if (scrn->focus_idx > 0) {
    scrn->focus_idx--;
  } else { // scrn->focus_idx <= 0. We are at the first control in the screen, going backwards.
    int ctrl_idx;

    ctrl_idx = 0;
    while (scrn->screen_ctrls[ctrl_idx].ctrl_type != ctrl_type_none) {
      ctrl_idx++;
    };
    scrn->focus_idx = ctrl_idx-1; // go to the last control
  }

  focus_new = &scrn->screen_ctrls[scrn->focus_idx];
  DrawCtrl (focus_new, /*has_focus*/true);
}

// On touching the screen:
// 1. Change focus to control at that location.
// 2. Click that control.
bool  do_click  = false;
bool was_click  = false;
void ScreenTouch(struct ctrl_screen_s *scrn, int touch_x, int touch_y) {
  int old_idx;
  int ctrl_idx;
  struct tab_ctrl_s *chk_ctrl;
  struct windw_s *chk_windw;
  struct tab_ctrl_s *focus_old;
  struct tab_ctrl_s *focus_new = NULL;

  old_idx = scrn->focus_idx;
  ctrl_idx = 0;
  do {
    if (scrn->screen_ctrls[ctrl_idx].ctrl_type == ctrl_type_none) {
      return; // got to the end of the list, found no control being touched
    }

    chk_ctrl = &scrn->screen_ctrls[ctrl_idx];
    chk_windw = GetCtrlWindow(chk_ctrl); // Get X and Y of control
    if (chk_windw != NULL) {
      if (touch_x >= chk_windw->wx &&
          touch_x <= chk_windw->wx+chk_windw->ww &&
          touch_y >= chk_windw->wy &&
          touch_y <= chk_windw->wy+chk_windw->wh) {
        // touch is within bounds of window
        scrn->focus_idx = ctrl_idx;
        do_click  = true;
        //was_click = true;
        break;
      }
    }
    ctrl_idx++;
  } while (1);

  if (scrn->focus_idx != old_idx) {
    focus_old = &scrn->screen_ctrls[old_idx];
    DrawCtrl (focus_old, /*has_focus*/false);

    focus_new = &scrn->screen_ctrls[scrn->focus_idx];
    DrawCtrl (focus_new, /*has_focus*/true);
  }
}

bool gamepad_found;
bool haptic_found;
bool fm_tx_found;
bool mp3_found;

