noisysouth/adaradio/rp2040_windw_adaradio/rp2040_windw_adaradio.ino
// ---------------------------- Define windows + controls. --------------------------
struct windw_s wnd_main;
//struct cap_windw_s cwnd_main;
//struct cap_twindw_s ctwnd_main;
//struct button_s btn_ok;
struct edit_s edit_text;
struct button_s btn_song1;
//struct button_s btn_song2;
//struct button_s btn_song3;
struct label_s lbl_fmfreq;
char fm_station_str[LABEL_MAX_TEXT];

struct ctrl_screen_s main_screen = {
  {
    { ctrl_edit,   &edit_text, },
    { ctrl_button, &btn_song1, },
//  { ctrl_button, &btn_song2, },
    { ctrl_type_none,  NULL, },
  },
  0, // focus_idx
};

struct ctrl_screen_s *cur_screen = &main_screen; // initial screen at start

// ------------------ setup ------------------
void setup(void) {
  //Serial.begin(9600);
  Serial.begin(115200);
  delay(2000);
  Serial.println(F("Hello! Welcome to windw serial port!"));

  // ------------------------ Start mp3 sound output ------------------------------------
#ifdef USE_MP3
  Serial.println(F("Checking MP3 sound output module (VS1053)..."));
  mp3_found = musicPlayer.begin();
  if (!mp3_found) { // initialise the music player
    Serial.println(F("Couldn't find MP3 sound output module (VS1053) - no sound output will be used. Check the right pins are defined?"));
    Serial.print("Reset: pin "); Serial.println(VS1053_RESET);
    Serial.print("MP3 chip select: pin "); Serial.println(VS1053_CS);
    Serial.print("Data select:     pin "); Serial.println(VS1053_DCS);
    Serial.print("Data request:    pin "); Serial.println(VS1053_DREQ);
    Serial.print("SD card chip select: pin "); Serial.println(CARDCS);
  } else {
    Serial.println(F("MP3 sound output module (VS1053) found OK."));

    musicPlayer.sineTest(0x44, 500);    // Make a tone to indicate VS1053 is working
    mp3_found = SD.begin(CARDCS);
    if (!mp3_found) {
      Serial.println(F("MP3 sound SD card failed / not present - no sound output will be used."));
    }
  }
  if (mp3_found) {
    Serial.println(F("MP3 sound SD card is OK!"));

    // list files
    printDirectory(SD.open("/"), 0);

    // Set volume for left, right channels. lower numbers == louder volume!
    musicPlayer.setVolume(10,10);

  #if defined(__AVR_ATmega32U4__)
    // Timer interrupts are not suggested, better to use DREQ interrupt!
    // but we don't have them on the 32u4 feather...
    musicPlayer.useInterrupt(VS1053_FILEPLAYER_TIMER0_INT); // timer int
  #else
    // If DREQ is on an interrupt pin we can do background
    // audio playing
    musicPlayer.useInterrupt(VS1053_FILEPLAYER_PIN_INT);  // DREQ int
  #endif
  }
#endif

  // ------------------------ Start FM RDS Radio Tx ------------------------------------
  Serial.println(F("Checking FM RDS transmitter..."));
  delay(2000);  
  fm_tx_found = radio.begin(); // begin with address 0x63 (CS high default)
  if (!fm_tx_found) {
    delay(2000);
    Serial.println("Couldn't find FM RDS transmitter?");
    snprintf (fm_station_str, LABEL_MAX_TEXT, "NO FM");
  } else {
    uint8_t noise_lvl;
    uint8_t lowest_noise_lvl = 255;
    uint16_t lowest_noise_freq = 0;

    delay(2000);
    Serial.println("Found FM RDS transmitter OK. Measuring...");
    
    // scan power of entire range from 87.5 to 108.0 MHz
    for (uint16_t f  = 8750; f<10800; f+=20) {
      radio.readTuneMeasure(f);
      if (f % 50 == 0) {
        Serial.print(f/100); 
        Serial.print('.'); 
        Serial.println(f % 100);
      }
#ifdef DEBUG_FM
      Serial.print("Measuring "); Serial.print(f); Serial.print("...");
#endif
      radio.readTuneStatus();
      noise_lvl = radio.currNoiseLevel;
#ifdef DEBUG_FM
      Serial.println(noise_lvl);
#endif
      if (lowest_noise_lvl > noise_lvl) {
        lowest_noise_lvl = noise_lvl;
        lowest_noise_freq = f;
      }
    }
    Serial.print("Lowest noise freq "); Serial.print(lowest_noise_freq); Serial.print(" at ");
    Serial.println(lowest_noise_lvl);
    fm_station_freq = lowest_noise_freq;

    Serial.print("\nSet TX power");
    radio.setTXpower(115);  // dBuV, 88-115 max

    Serial.print("\nTuning into "); 
    Serial.print(fm_station_freq/100); 
    Serial.print('.'); 
    Serial.println(fm_station_freq % 100);
    radio.tuneFM(fm_station_freq); // e.g. 102.3 mhz
    snprintf (fm_station_str, LABEL_MAX_TEXT, "%d.%d", fm_station_freq/100, (fm_station_freq % 100)/10);

    // This will tell you the status in case you want to read it from the chip
    radio.readTuneStatus();
    Serial.print("\tCurr freq: "); 
    Serial.println(radio.currFreq);
    Serial.print("\tCurr freqdBuV:"); 
    Serial.println(radio.currdBuV);
    Serial.print("\tCurr ANTcap:"); 
    Serial.println(radio.currAntCap);

    // begin the RDS/RDBS transmission
    radio.beginRDS();
    radio.setRDSstation("AdaRadio");
    radio.setRDSbuffer( "Adafruit g0th Radio!");

    Serial.println("RDS on!");  
  }

  // Start TFT display
#ifdef ESP32_S3_TFT
  // turn on backlite
  pinMode(TFT_BACKLITE, OUTPUT);
  digitalWrite(TFT_BACKLITE, HIGH);

  //pinMode(TFT_BACKLIGHT, OUTPUT);
  //digitalWrite(TFT_BACKLIGHT, HIGH); // Backlight on; for CircuitPlayground Express TFT Gizmo

  // turn on the TFT / I2C power supply
  pinMode(TFT_I2C_POWER, OUTPUT);
  digitalWrite(TFT_I2C_POWER, HIGH);
  delay(10);

  tft.init(PIXELS_Y, PIXELS_X);                // Init ST7789 ST7789 240x135 on ESP32-S3 TFT
#endif

  // ----------------------- start touchscreen input ----------------------------
#ifdef HX8357
  #if defined(_ADAFRUIT_STMPE610H_)
    if (!ts.begin()) {
      Serial.println("Couldn't start STMPE touchscreen controller");
      while (1) delay(100);
    }
    touch_minx = STMPE_TS_MINX; touch_maxx = STMPE_TS_MAXX;
    touch_miny = STMPE_TS_MINY; touch_maxy = STMPE_TS_MAXY;
  #else
    if (! ts.begin(0x48, &Wire)) {
      Serial.println("Couldn't start TSC2007 touchscreen controller");
      while (1) delay(100);
    }
    touch_minx = TSC_TS_MINX; touch_maxx = TSC_TS_MAXX;
    touch_miny = TSC_TS_MINY; touch_maxy = TSC_TS_MAXY;
    pinMode(TSC_IRQ, INPUT);
  #endif
  Serial.println("Touchscreen started");

  tft.begin();

  // read TFT display diagnostics (optional but can help debug problems)
  uint8_t x = tft.readcommand8(HX8357_RDPOWMODE);
  Serial.print("Display Power Mode: 0x"); Serial.println(x, HEX);
  x = tft.readcommand8(HX8357_RDMADCTL);
  Serial.print("MADCTL Mode: 0x"); Serial.println(x, HEX);
  x = tft.readcommand8(HX8357_RDCOLMOD);
  Serial.print("Pixel Format: 0x"); Serial.println(x, HEX);
  x = tft.readcommand8(HX8357_RDDIM);
  Serial.print("Image Format: 0x"); Serial.println(x, HEX);
  x = tft.readcommand8(HX8357_RDDSDR);
  Serial.print("Self Diagnostic: 0x"); Serial.println(x, HEX); 
#endif
  tft.setRotation(3);//tft.setRotation(2);
  tft.fillScreen(color_backgr);

  Serial.println(F("Initialized"));

  uint16_t time = millis();
  tft.fillScreen(color_backgr);
  time = millis() - time;

  Wire.begin();        // join i2c bus (address optional for master)

  // ------------------------ Start mini gamepad input ---------------------------
  gamepad_found = ss.begin(0x50);
  if (!gamepad_found) {
    Serial.println("seesaw not found - no gamepad will be used.");
  } else { // gamepad_found
    Serial.println("gamepad started");

    uint32_t version = ((ss.getVersion() >> 16) & 0xFFFF);
    if (version != 5743) {
      Serial.print("Wrong firmware loaded? ");
      Serial.println(version);
      while(1) delay(10);
    }
    Serial.println("Found Product 5743");
    
    ss.pinModeBulk(button_mask, INPUT_PULLUP);
    ss.setGPIOInterrupts(button_mask, 1);

