noisysouth/adaradio/rp2040_windw_adaradio/rp2040_windw_adaradio.ino
  #if defined(IRQ_PIN)
    pinMode(IRQ_PIN, INPUT);
  #endif
  }
  
  Serial.println(time, DEC);
  tft.fillScreen(color_backgr);

  // --------------------------------- Start haptic output ----------------------------
  haptic_found = drv.begin();
  if (!haptic_found) {
    Serial.println("DRV2605 not found - no haptic feedback will be used.");
  } else { // haptic_found
    drv.selectLibrary(1);
  
    // I2C trigger by sending 'go' command 
    // default, internal trigger when sending GO command
    drv.setMode(DRV2605_MODE_INTTRIG); 
  }

  // ------------------------  Set up on-board digital input button -------------------------
  pinMode     (PIN_BOOT_BUTTON, INPUT_PULLUP);
  //digitalWrite(PIN_BOOT_BUTTON, HIGH); // enable pull-up

  // ---------------------------- Set up screen controls -----------------------------------
  SetupWindow (&wnd_main, /*x0*/0, /*y0*/0, tft.width()-1, tft.height()-1, /*border*/1, /*buffered*/0);
  DrawWindow (&wnd_main);
  //SetupCapWindow (&cwnd_main, /*x0*/0, /*y0*/0, tft.width()-1, tft.height()-1, /*border*/1, /*buffered*/0, "MP3 Jukebox");
  //DrawCapWindow (&cwnd_main);
  //SetupCapTWindow (&ctwnd_main, "MP3 Jukebox", "radio_gaga.mp3", "top_gun_theme.mp3");
  //SetupCapTWindow (&ctwnd_main, "MP3 Jukebox", "", "");
  //DrawCapTWindow (&ctwnd_main);

  //SetupButton (&btn_ok, /*x*/(tft.width()/2)-BUTTON_WIDTH_PIXELS/2, /*y*/tft.height()-BUTTON_HEIGHT_PIXELS-6, "OK");
  //DrawButton (&btn_ok);
  SetupEdit (&edit_text, /*x*/20, /*y*/12, /*text_max_chars*/16, "My Radio");
  DrawEdit (&edit_text, /*has_focus*/1);
  
  //SetupButton (&btn_song1, /*x*/20, /*y*/tft.height()-BUTTON_HEIGHT_PIXELS*2-18, "radio_gaga.mp3");
  SetupButton (&btn_song1, /*x*/20, /*y*/12+EDIT_HEIGHT_PIXELS+6, "radio_gaga.mp3");
  DrawButton (&btn_song1, /*has_focus*/0);
  //SetupButton (&btn_song2, /*x*/20, /*y*/tft.height()-BUTTON_HEIGHT_PIXELS-12, "top_gun.mp3");
  //SetupButton (&btn_song2, /*x*/20, /*y*/12+EDIT_HEIGHT_PIXELS+6+BUTTON_HEIGHT_PIXELS+6, "top_gun.mp3");
  //DrawButton (&btn_song2, /*has_focus*/0);
  //SetupButton (&btn_song3, /*x*/10, /*y*/tft.height()-BUTTON_HEIGHT_PIXELS*2-12, "starships.mp3");
  //DrawButton (&btn_song3, /*has_focus*/1);
  SetupLabel (&lbl_fmfreq, /*x*/154, /*y*/12+EDIT_HEIGHT_PIXELS+6+BUTTON_HEIGHT_PIXELS+6, /*max_chars "102.1"*/5, /*text_default*/fm_station_str);
  DrawLabel (&lbl_fmfreq, /*has_focus*/0);
}

// ---------------------- MP3 sound output: list SD card files ------------------
#ifdef USE_MP3
/// File listing helper
// print files on SD card, which should include sound files for this game
void printDirectory(File dir, int numTabs) {
   while(true) {

     File entry =  dir.openNextFile();
     if (! entry) {
       // no more files
       //Serial.println("**nomorefiles**");
       break;
     }
     for (uint8_t i=0; i<numTabs; i++) {
       Serial.print('\t');
     }
     Serial.print(entry.name());
     if (entry.isDirectory()) {
       Serial.println("/");
       printDirectory(entry, numTabs+1);
     } else {
       // files have sizes, directories do not
       Serial.print("\t\t");
       Serial.println(entry.size(), DEC);
     }
     entry.close();
   }
}
#endif

// ---------------------- CardKB mini keyboard constants ------------------
#define KB_ADDR 0x5f
#define MIN_PRINTABLE ' '
#define MAX_PRINTABLE '~'

// When you press Fn+A thru Fn+Z on cardkb,
//  the cardkb will return these values.
#define FUNC_KEY_COUNT ('Z'-'A'+1)
unsigned func_keys[FUNC_KEY_COUNT] =  // Fn+
{	0x9a, 0xaa, 0xa8, 0x9c, 0x8f, 0x9d, // abc def
	0x9e, 0x9f, 0x94, 0xa0, 0xa1, 0xa2, // ghi jkl
	0xac, 0xab, 0x95, 0x96, 0x8d, 0x90, // mno pqr
	0x9b, 0x91, 0x93, 0xa9, 0x8e, 0xa7, // stu vwx
	0x92, 0xa6 }; // yz
#define OKALT      '\n'
#define CANCELALT  0x1b
#define KEY_BACKSPACE 0x8
#define KEY_LEFT  0xb4 // <--
#define KEY_UP    0xb5 // ^
#define KEY_DOWN  0xb6 // v
#define KEY_RIGHT 0xb7 //  -->

// -------------------------------- loop --------------------------------

int last_x = 0, last_y = 0; // old joystick position
void loop() {
  int x_move;
  int y_move;
  static int  y_old = 0;
  char        kb_in = 0; // no key pressed
  bool        do_unclick = false;

  // do_click can be set by touch, kb_in Enter press, or digital input button.
  do_click = false;

  if (fm_tx_found) {
#ifdef DEBUG_FM
    radio.readASQ();
    Serial.print("\tCurr ASQ: 0x"); 
    Serial.println(radio.currASQ, HEX);
    Serial.print("\tCurr InLevel:"); 
    Serial.println(radio.currInLevel);
#endif
  }

  // --------------------- Check touchscreen input -------------------------
#if defined(TSC_IRQ)
  if (!digitalRead(TSC_IRQ)) {
    // IRQ pin is low, we can read from touchscreen!

    TS_Point p_raw = ts.getPoint();
    int touch_x, touch_y;

    Serial.print("X = "); Serial.print(p_raw.x);
    Serial.print("\tY = "); Serial.print(p_raw.y);
    Serial.print("\tPressure = "); Serial.print(p_raw.z);
    if (((p_raw.x == 0) && (p_raw.y == 0)) || (p_raw.z < 10)) return; // no pressure, no touch
  
    // Scale from ~0->4000 to tft.width using the calibration #'s
    //OK with some TFT rotations:
    //p.x = map(p.x, touch_minx, touch_maxx, 0, tft.width());
    //p.y = map(p.y, touch_miny, touch_maxy, 0, tft.height());
    //Serial.print(" -> "); Serial.print(p.x); Serial.print(", "); Serial.println(p.y);
    //our TFT rotation:
    touch_x = map(p_raw.y, touch_miny, touch_maxy, tft.width(), 0); // screen x: raw y scaled, and left-right mirrored
    touch_y = map(p_raw.x, touch_minx, touch_maxx, 0, tft.height());  // screen y: raw x scaled
    Serial.print(" -> "); Serial.print(touch_x); Serial.print(", "); Serial.println(touch_y);

    ScreenTouch(cur_screen, touch_x, touch_y);
  }
#endif

   // ----------------------  Check CardKB mini keyboard input --------------------------
  Wire.requestFrom(KB_ADDR, 1);    // request 1 byte from peripheral device KB_ADDR

  x_move = 0;
  y_move = 0;

  if (Wire.available()) { // peripheral may send less than requested
    kb_in = Wire.read(); // receive a byte as character
    switch (kb_in) {
    case 0x00: // nothing pressed. do nothing.
      break;
    case 0xd: // Enter
      kb_in = '\n';
      do_click = true;
      //was_click = true;
      break;
    case 0x1b: // Escape
      break;
    case KEY_BACKSPACE: // Backspace
      break;
    case 0x9: // Tab
      break;
    case KEY_LEFT: // <- Left
      x_move = -1;
      break;
    case KEY_UP: // ^ Up
      y_move = -1;
      break;
    case KEY_DOWN: // v Down
      y_move = 1;
      break;
    case KEY_RIGHT: // Right ->
      x_move = 1;
      break;
    default:
      if (kb_in >= MIN_PRINTABLE && kb_in <= MAX_PRINTABLE) {
        // A-Z, 1-9, punctuation, space
      } else {
        // Someone probably pressed "Function" + key, got 0x80 thru 0xAF
        // See https://docs.m5stack.com/en/unit/cardkb_1.1
      }
    }
    //Serial.print(kb_in);         // print the character
  }

