noisysouth/adaradio/rp2040_windw_adaradio/rp2040_windw_adaradio.ino
#ifdef DEBUG_BUTTONS
  Serial.print("Left Button: ");
  if (left_btn) {
    Serial.print("DOWN");
  } else {
    Serial.print("  UP");
  }
  Serial.print("   Right Button: ");
  if (right_btn) {
    Serial.print("DOWN");
  } else {
    Serial.print("  UP");    
  }
  Serial.println();
#endif

  // ------------------------ Check mini gamepad input ---------------------------
  if (gamepad_found) {
    // Reverse x/y values to match joystick orientation
    int joy_x = 1023 - ss.analogRead(14);
    int joy_y = 1023 - ss.analogRead(15);
    
    if ( (abs(joy_x - last_x) > 3)  ||  (abs(joy_y - last_y) > 3)) {
      Serial.print("joy_x: "); Serial.print(joy_x); Serial.print(", "); Serial.print("joy_y: "); Serial.println(joy_y);
      last_x = joy_x;
      last_y = joy_y;
    }
    // X joystick axis: be more sensitive, as it is harder to push
    if (joy_x < 400) {
      x_move = -1;
    }
    if (joy_x > 600) {
      x_move = 1;
    }
    // Y joystick axis: be less sensitive, as it is so easy to push (don't override X motions)
    if (joy_y < 128) {
      y_move = 1;
    }
    if (joy_y > 900) {
      y_move = -1;
    }
#if defined(IRQ_PIN)
    if(!digitalRead(IRQ_PIN)) {
      return;
    }
#endif

    uint32_t buttons = ss.digitalReadBulk(button_mask);
    if (! (buttons & (1UL << BUTTON_X))) {
      y_move = -1;
    }
    if (! (buttons & (1UL << BUTTON_B))) {
      y_move = 1;
    }
    if (! (buttons & (1UL << BUTTON_Y))) {
      x_move = -1;
    }
    if (! (buttons & (1UL << BUTTON_A))) {
      x_move = 1;
    }
  } // end if(gamepad_found)

  // move the direction that was tilted the fastest,
  //  or if none tilted fast, the way we are most tilted.
  if (y_move > 0 && y_old == 0) {
    ScreenTabNext(cur_screen);
  }
  if (y_move < 0 && y_old == 0) {
    ScreenTabPrev(cur_screen);
  }
  if (x_move > 0) {
    do_click = true;
    //was_click = true;
  }
  if (was_click && !do_click) {
    do_unclick = true;
  }

  // ------------------------ Check onboard digital input button ---------------------------
  int btn_in = digitalRead(PIN_BOOT_BUTTON);
  static int old_btn_in = 1;

  if (!btn_in && old_btn_in) { // b/c pull-up
    do_click = true;
  }
  if (btn_in && !old_btn_in) { // un-click
    do_unclick = true;
  }

  // ------------------------- Send input to control that has focus --------------------------
  struct tab_ctrl_s *focus_ctrl;
  focus_ctrl = &cur_screen->screen_ctrls[cur_screen->focus_idx];

  if (do_click) {
    OnClickCtrl (focus_ctrl);
  }
  if (do_unclick) {
    haptic_click ();
    DrawCtrl (focus_ctrl, /*has_focus*/true);
    was_click = false;
  }

  UpdateCtrl (focus_ctrl); // e.g. for cursor blink, etc.
  if (kb_in != 0) {
    OnKeyCtrl (focus_ctrl, kb_in);
  }
  old_btn_in = btn_in;
  y_old = y_move;

  delay(100);
}

// ---------------- make a haptic rumble "click" ------------
void haptic_click(void) {
  if (!haptic_found) {
    return;
  }
  int effect = 1; // Strong Click - 100%

  // set the effect to play
  drv.setWaveform(0, effect);  // play effect 
  drv.setWaveform(1, 0);       // end waveform

  // play the effect!
  drv.go();
}

// ----------------------- draw Dashed lines -----------------------------

#define DOT_LINE_LEN 10
#define DOT_SPACE_LEN 3
#define FOCUS_MARGIN_PIXELS 4

// to TFT
#ifdef ESP32_S3_TFT
  void DrawDashedHLine(Adafruit_ST7789 *scrn, int line_x, int line_y, int line_w) {
#endif
#ifdef HX8357
  void DrawDashedHLine(Adafruit_HX8357 *scrn, int line_x, int line_y, int line_w) {
#endif
    // top and left sides
    int start_px, end_px;
    int width_px;
    int limit_px;

    start_px = line_x;
    limit_px = line_x + line_w;

    width_px = DOT_LINE_LEN;
    while (start_px < limit_px) {
      end_px = start_px + width_px;
      if (end_px > limit_px) {
        end_px = limit_px;
        width_px = end_px - limit_px;
      }

      scrn->drawFastHLine(start_px, line_y, width_px, color_focus_border);
      start_px += DOT_LINE_LEN + DOT_SPACE_LEN;
    }
}

#ifdef ESP32_S3_TFT
  void DrawDashedVLine(Adafruit_ST7789 *scrn, int line_x, int line_y, int line_w) {
#endif
#ifdef HX8357
  void DrawDashedVLine(Adafruit_HX8357 *scrn, int line_x, int line_y, int line_w) {
#endif
    // top and left sides
    int start_py, end_py;
    int height_py;
    int limit_py;

    start_py = line_y;
    limit_py = line_y + line_w;

    height_py = DOT_LINE_LEN;
    while (start_py < limit_py) {
      end_py = start_py + height_py;
      if (end_py > limit_py) {
        end_py = limit_py;
        height_py = end_py - limit_py;
      }
      scrn->drawFastVLine(line_x, start_py, height_py, color_focus_border);
      start_py += DOT_LINE_LEN + DOT_SPACE_LEN;
    }
}

// to Canvas
void DrawDashedHLineToCanvas(GFXcanvas16 *canvas, int line_x, int line_y, int line_w) {
    // top and left sides
    int start_px, end_px;
    int width_px;
    int limit_px;

    start_px = line_x;
    limit_px = line_x + line_w;

    width_px = DOT_LINE_LEN;
    while (start_px < limit_px) {
      end_px = start_px + width_px;
      if (end_px > limit_px) {
        end_px = limit_px;
        width_px = end_px - limit_px;
      }
      canvas->drawFastHLine(start_px, line_y, width_px, color_focus_border);
      start_px += DOT_LINE_LEN + DOT_SPACE_LEN;
    }
}

void DrawDashedVLineToCanvas(GFXcanvas16 *canvas, int line_x, int line_y, int line_w) {
    // top and left sides
    int start_py, end_py;
    int height_py;
    int limit_py;

    start_py = line_y;
    limit_py = line_y + line_w;

    height_py = DOT_LINE_LEN;
    while (start_py < limit_py) {
      end_py = start_py + height_py;
      if (end_py > limit_py) {
        end_py = limit_py;
        height_py = end_py - limit_py;
      }
      canvas->drawFastVLine(line_x, start_py, height_py, color_focus_border);
      start_py += DOT_LINE_LEN + DOT_SPACE_LEN;
    }
}

// Adapted from: Borland C++ Power Programming by Clayton Walnum
// https://fabiensanglard.net/reverse_engineering_strike_commander/docs/Borland_C___Power_Programming_Book_and_Disk__Programming_.pdf
// pg. 129 (PDF pg. 143)

