noisysouth/adaradio/rp2040_windw_adaradio/rp2040_windw_adaradio.ino
// ------------------- draw Border ------------------------

#ifdef ESP32_S3_TFT
  void DrawBorder(Adafruit_ST7789 *scrn, struct windw_s *wnd, int brd_style) {
#endif
#ifdef HX8357
  void DrawBorder(Adafruit_HX8357 *scrn, struct windw_s *wnd, int brd_style) {
#endif
  int bx, by, bw, bh;

  bx = wnd->wx;
  by = wnd->wy;
  bw = wnd->ww;
  bh = wnd->wh;
  
  switch (brd_style) {
  case border_outset:
    // highlight - top and left sides, 2 pixels wide each
    scrn->drawFastHLine(bx,   by,   bw,   color_highlight); //  top edge - outer
    scrn->drawFastVLine(bx,   by,   bh,   color_highlight); // left edge - outer
    scrn->drawFastHLine(bx+1, by+1, bw-2, color_highlight); //  top edge - inner
    scrn->drawFastVLine(bx+1, by+1, bh-2, color_highlight); // left edge - innder

    // shadow - bottom and right sides, 2 pixels wide each
    scrn->drawFastHLine(bx+1,    by+bh-1, bw-1, color_shadow); // bottom edge - outer
    scrn->drawFastVLine(bx+bw-1, by,      bh,   color_shadow); //  right edge - outer
    scrn->drawFastHLine(bx+2,    by+bh-2, bw-3, color_shadow); // bottom edge - inner
    scrn->drawFastVLine(bx+bw-2, by+1,    bh-2, color_shadow); //  right edge - inner
    break;
  case border_ridge:
    scrn->drawFastHLine(bx+10,      by+10,      bw-20, color_shadow); //  top margin line
    scrn->drawFastVLine(bx+10,      by+10,      bh-20, color_shadow); // left margin line
    scrn->drawFastHLine(bx+10,      by+bh - 10, bw-20, color_highlight); // bottom margin line    
    scrn->drawFastVLine(bx+bw - 10, 10,         bh-20, color_highlight); //   left margin line
    break;
  case border_outset_narrow: // Draw caption bar
    scrn->drawFastVLine(bx + 20,      by+20, 20,      color_highlight);  //   left edge
    scrn->drawFastHLine(bx + 20,      by+20, bw - 40, color_highlight);  //    top edge
    scrn->drawFastVLine(bx + bw - 20, by+20, 21,      color_cap_shadow); //  right edge
    scrn->drawFastHLine(bx + 20,      by+40, bw - 40, color_cap_shadow); // bottom edge
    break;
  case border_inset:
    // shadow - top and left sides, 2 pixels wide each
    scrn->drawFastHLine(bx,   by,   bw-1, color_shadow); //  top edge - outer
    scrn->drawFastVLine(bx,   by,   bh-1, color_shadow); // left edge - outer
    scrn->drawFastHLine(bx+1, by+1, bw-3, color_shadow); //  top edge - inner
    scrn->drawFastVLine(bx+1, by+1, bh-3, color_shadow); // left edge - innder

    // highlight - bottom and right sides, 2 pixels wide each
    scrn->drawFastHLine(bx+1,      by + bh-1, bw-1, color_highlight); // bottom edge - outer
    scrn->drawFastVLine(bx + bw-1, by,        bh-1, color_highlight); //  right edge - outer
    scrn->drawFastHLine(bx+2,      by + bh-2, bw-3, color_highlight); // bottom edge - inner
    scrn->drawFastVLine(bx + bw-2, by+1,      bh-3, color_highlight); //  right edge - inner
    break;
  case border_focus:
    // for some reason using the scrn parameter does not work here?
    DrawDashedHLine(scrn, bx+FOCUS_MARGIN_PIXELS, by+FOCUS_MARGIN_PIXELS,      bw-FOCUS_MARGIN_PIXELS*2); // top edge outer
    DrawDashedHLine(scrn, bx+FOCUS_MARGIN_PIXELS, by+FOCUS_MARGIN_PIXELS+1,    bw-FOCUS_MARGIN_PIXELS*2); // top edge inner
    DrawDashedHLine(scrn, bx+FOCUS_MARGIN_PIXELS, by+bh-FOCUS_MARGIN_PIXELS-1, bw-FOCUS_MARGIN_PIXELS*2); // bottom edge inner
    DrawDashedHLine(scrn, bx+FOCUS_MARGIN_PIXELS, by+bh-FOCUS_MARGIN_PIXELS,   bw-FOCUS_MARGIN_PIXELS*2); // bottom edge outer

    DrawDashedVLine(scrn, bx+FOCUS_MARGIN_PIXELS,      by+FOCUS_MARGIN_PIXELS, bh-FOCUS_MARGIN_PIXELS*2); // left edge outer
    DrawDashedVLine(scrn, bx+FOCUS_MARGIN_PIXELS+1,    by+FOCUS_MARGIN_PIXELS, bh-FOCUS_MARGIN_PIXELS*2); // left edge inner
    DrawDashedVLine(scrn, bx+bw-FOCUS_MARGIN_PIXELS-1, by+FOCUS_MARGIN_PIXELS, bh-FOCUS_MARGIN_PIXELS*2); // right edge inner
    DrawDashedVLine(scrn, bx+bw-FOCUS_MARGIN_PIXELS,   by+FOCUS_MARGIN_PIXELS, bh-FOCUS_MARGIN_PIXELS*2); // right edge outer
    break;
  default:
    break;
  }
}

void DrawBorderToCanvas(GFXcanvas16 *canvas, struct windw_s *wnd, int brd_style) {
  int bx, by, bw, bh;
  
  bx = 0;
  by = 0;
  bw = wnd->ww;
  bh = wnd->wh;

  switch (brd_style) {
  case border_outset:
    // highlight - top and left sides, 2 pixels wide each
    canvas->drawFastHLine(bx,   by,   bw,   color_highlight); //  top edge - outer
    canvas->drawFastVLine(bx,   by,   bh,   color_highlight); // left edge - outer
    canvas->drawFastHLine(bx+1, by+1, bw-2, color_highlight); //  top edge - inner
    canvas->drawFastVLine(bx+1, by+1, bh-2, color_highlight); // left edge - innder

    // shadow - bottom and right sides, 2 pixels wide each
    canvas->drawFastHLine(bx+1,    by+bh-1, bw-1, color_shadow); // bottom edge - outer
    canvas->drawFastVLine(bx+bw-1, by,      bh,   color_shadow); //  right edge - outer
    canvas->drawFastHLine(bx+2,    by+bh-2, bw-3, color_shadow); // bottom edge - inner
    canvas->drawFastVLine(bx+bw-2, by+1,    bh-2, color_shadow); //  right edge - inner
    break;
  case border_ridge:
    canvas->drawFastHLine(bx+10,      by+10,      bw-20, color_shadow); //  top margin line
    canvas->drawFastVLine(bx+10,      by+10,      bh-20, color_shadow); // left margin line
    canvas->drawFastHLine(bx+10,      by+bh - 10, bw-20, color_highlight); // bottom margin line    
    canvas->drawFastVLine(bx+bw - 10, 10,         bh-20, color_highlight); //   left margin line
    break;
  case border_outset_narrow: // Draw caption bar
    canvas->drawFastVLine(bx + 20,      by+20, 20,      color_highlight);  //   left edge
    canvas->drawFastHLine(bx + 20,      by+20, bw - 40, color_highlight);  //    top edge
    canvas->drawFastVLine(bx + bw - 20, by+20, 21,      color_cap_shadow); //  right edge
    canvas->drawFastHLine(bx + 20,      by+40, bw - 40, color_cap_shadow); // bottom edge
    break;
  case border_inset:
    // shadow - top and left sides, 2 pixels wide each
    canvas->drawFastHLine(bx,   by,   bw-1, color_shadow); //  top edge - outer
    canvas->drawFastVLine(bx,   by,   bh-1, color_shadow); // left edge - outer
    canvas->drawFastHLine(bx+1, by+1, bw-3, color_shadow); //  top edge - inner
    canvas->drawFastVLine(bx+1, by+1, bh-3, color_shadow); // left edge - innder

    // highlight - bottom and right sides, 2 pixels wide each
    canvas->drawFastHLine(bx+1,      by + bh-1, bw-1, color_highlight); // bottom edge - outer
    canvas->drawFastVLine(bx + bw-1, by,        bh-1, color_highlight); //  right edge - outer
    canvas->drawFastHLine(bx+2,      by + bh-2, bw-3, color_highlight); // bottom edge - inner
    canvas->drawFastVLine(bx + bw-2, by+1,      bh-3, color_highlight); //  right edge - inner
    break;
  case border_focus:
    DrawDashedHLineToCanvas(canvas, bx+FOCUS_MARGIN_PIXELS, by+FOCUS_MARGIN_PIXELS,      bw-FOCUS_MARGIN_PIXELS*2); // top edge outer
    DrawDashedHLineToCanvas(canvas, bx+FOCUS_MARGIN_PIXELS, by+FOCUS_MARGIN_PIXELS+1,    bw-FOCUS_MARGIN_PIXELS*2); // top edge inner
    DrawDashedHLineToCanvas(canvas, bx+FOCUS_MARGIN_PIXELS, by+bh-FOCUS_MARGIN_PIXELS-1, bw-FOCUS_MARGIN_PIXELS*2); // bottom edge inner
    DrawDashedHLineToCanvas(canvas, bx+FOCUS_MARGIN_PIXELS, by+bh-FOCUS_MARGIN_PIXELS,   bw-FOCUS_MARGIN_PIXELS*2); // bottom edge outer

    DrawDashedVLineToCanvas(canvas, bx+FOCUS_MARGIN_PIXELS,      by+FOCUS_MARGIN_PIXELS, bh-FOCUS_MARGIN_PIXELS*2); // left edge outer
    DrawDashedVLineToCanvas(canvas, bx+FOCUS_MARGIN_PIXELS+1,    by+FOCUS_MARGIN_PIXELS, bh-FOCUS_MARGIN_PIXELS*2); // left edge inner
    DrawDashedVLineToCanvas(canvas, bx+bw-FOCUS_MARGIN_PIXELS-1, by+FOCUS_MARGIN_PIXELS, bh-FOCUS_MARGIN_PIXELS*2); // right edge inner
    DrawDashedVLineToCanvas(canvas, bx+bw-FOCUS_MARGIN_PIXELS,   by+FOCUS_MARGIN_PIXELS, bh-FOCUS_MARGIN_PIXELS*2); // right edge outer
    break;
  default:
    break;
  }
}

// ---------------------- basic Window  --------------------

void DrawWindowToCanvas(struct windw_s *wnd, GFXcanvas16 *canvas) {
  // in buffer, origin is (0,0)
  // on screen, origin is (wx,wy)
  DrawBorderToCanvas (canvas, wnd, border_outset);

  // center
  canvas->fillRect(2, 2, wnd->ww-4, wnd->wh-4, color_window);

  //Draw border, if requested.
  if (wnd->border_style == border_ridge) {
    DrawBorderToCanvas (canvas, wnd, border_ridge);
  }
}

void SetupWindow(struct windw_s *wnd, int x, int y, int w, int h, int brd_style, int buf) {
  wnd->wx = x;
  wnd->wy = y;
  wnd->ww = w;
  wnd->wh = h;
  wnd->border_style = brd_style;
  wnd->buffered = buf;
  Serial.print("SetupWindow(x=");
  Serial.print(x);
  Serial.print(", y=");
  Serial.print(y);
  Serial.print(", w=");
  Serial.print(w);
  Serial.print(", h=");
  Serial.print(h);
  Serial.print(", brd_style=");
  Serial.print(brd_style);
  Serial.print(", buf=");
  Serial.print(buf);
  Serial.println(")");
  if (buf) {
    wnd->canvas = new GFXcanvas16(w, h);
    DrawWindowToCanvas (wnd, wnd->canvas);
  } else {
    wnd->canvas = NULL;
  }
}

void DrawWindow(struct windw_s *wnd) {
  //Draw basic 3-D window.

  if (wnd->buffered) {
    tft.drawRGBBitmap(wnd->wx,   wnd->wy, wnd->canvas->getBuffer(), wnd->canvas->width(), wnd->canvas->height());
  } else { // !wnd->buffered
    DrawBorder (&tft, wnd, border_outset);

    // center
    tft.fillRect(wnd->wx+2, wnd->wy+2, wnd->ww-3, wnd->wh-3, color_window);

    //Draw border, if requested.
    if (wnd->border_style == border_ridge) {
      DrawBorder (&tft, wnd, border_ridge);
    }
  }
}



// ---------------------- Captioned Window  --------------------

void SetupCapWindow(struct cap_windw_s *cwnd, int x, int y, int w, int h, int brd, int buf, char *cap) {
  SetupWindow(&cwnd->windw, x, y, w, h, brd, buf);
  if (cap != NULL) {
    strncpy (cwnd->label, cap, WINDW_MAX_CAP);
  } else { // cap == NULL
    cwnd->label[0] = '\x0';
  }
  cwnd->label[WINDW_MAX_CAP-1] = '\x0'; // ensure null term.
}

void DrawCapWindow(struct cap_windw_s *cwnd) {
  struct windw_s *wnd;
  wnd = &cwnd->windw;

  DrawWindow (wnd);

  // Draw caption bar
  DrawBorder (&tft, wnd, border_outset_narrow);  

  // center
  tft.fillRect(wnd->wx+21, wnd->wy+21, wnd->ww-41, 19, color_cap_bar);

  // label
  tft.setTextSize(2);
	int x = (wnd->wx + wnd->ww / 2) - (strlen(cwnd->label) * CHAR_WIDTH_PIXELS / 2);
  tft.setCursor(x, wnd->wy+22);
  tft.setTextColor(color_cap_label);
  tft.setTextWrap(true);
  tft.print(cwnd->label);
}

// ---------------------- Captioned Text Window --------------------
void SetupCapTWindow(struct cap_twindw_s *ctwnd, char *cap, char *ln1, char *ln2) {
  int str_w;
  int wndw_w = 230; // minumum width
  int wndw_x;
  int wndw_y = 164; // default y
  int wndw_h = 150; // default height

  if (cap != NULL) {
    str_w = strlen(cap) * CHAR_WIDTH_PIXELS + 60;
    if (wndw_w < str_w) {
      wndw_w = str_w;
    }
  }
  if (ln1 != NULL) {
    str_w = strlen(ln1) * CHAR_WIDTH_PIXELS + 60;
    if (wndw_w < str_w) {
      wndw_w = str_w;
    }
  }
  if (ln2 != NULL) {
    str_w = strlen(ln2) * CHAR_WIDTH_PIXELS + 60;
    if (wndw_w < str_w) {
      wndw_w = str_w;
    }
  }
  if (wndw_w > tft.width()-1) { // limit to screen bounds
    wndw_w = tft.width()-1;
  }
  wndw_x = (tft.width()/2) - wndw_w/2;

