noisysouth/adaradio/rp2040_windw_adaradio/rp2040_windw_adaradio.ino
  if (wndw_h > tft.height()-1) {
    wndw_h = tft.height()-1;
  }
  if (wndw_y + wndw_h > tft.height()) {
    wndw_y = (tft.height()/2) - wndw_h/2;
  }

  if (ln1 != NULL) {
    strncpy (ctwnd->line1, ln1, WINDW_MAX_LINE);
  } else { // ln1 == NULL
    ctwnd->line1[0] = '\x0';
  }
  ctwnd->line1[WINDW_MAX_LINE-1] = '\x0'; // ensure null term.

  if (ln2 != NULL) {
    strncpy (ctwnd->line2, ln2, WINDW_MAX_LINE);
  } else { // ln2 == NULL
    ctwnd->line2[0] = '\x0';
  }
  ctwnd->line2[WINDW_MAX_LINE-1] = '\x0';
  
  SetupCapWindow(&ctwnd->cwindw, wndw_x, wndw_y, wndw_w, wndw_h, 0/*border*/, 1/*buffered*/, cap);
}

void DrawCapTWindow(struct cap_twindw_s *ctwnd) {
  struct cap_windw_s *cwnd;
  struct windw_s *wnd;
  cwnd = &ctwnd->cwindw;
  wnd = &cwnd->windw;

  DrawCapWindow (cwnd);
	// Position and draw window body text.
  tft.setTextSize(2);
  tft.setTextWrap(true);
  tft.setTextColor(color_wndw_text);
	int x = (wnd->wx + wnd->ww / 2) - (strlen(ctwnd->line1) * CHAR_WIDTH_PIXELS) / 2;
	if (strlen(ctwnd->line2) == 0) {
    tft.setCursor(x, wnd->wy+68);
    tft.print(ctwnd->line1);
  } else { // strlen(line2) != 0
    tft.setCursor(x, wnd->wy+56);
    tft.print(ctwnd->line1);
	  x = (wnd->wx + wnd->ww / 2) - (strlen(ctwnd->line2) * CHAR_WIDTH_PIXELS) / 2;
    tft.setCursor(x, wnd->wy+71);
    tft.print(ctwnd->line2);
  }
}



// ---------------------- Button functions --------------------

void DrawButtonLabelToCanvas(struct button_s *btn) {
	int pos = -1;                  // position in 'btn->label_str' where '^' was found
	char tlabel[BUTTON_MAX_LABEL]; // copy of 'btn->label_str' with no '^' character
  GFXcanvas16 *lc;
  struct windw_s *wnd;
  wnd = &btn->windw;

  lc = btn->label_canvas;
  lc->fillScreen(color_window); // Clear button label canvas (not tft)

	// Find and remove the ^ character and
	// set the appropriate hot key.
	strncpy(tlabel, btn->label_str, BUTTON_MAX_LABEL);
  tlabel[BUTTON_MAX_LABEL-1] = '\x0';
	for (int i = 0; i < strlen(tlabel); ++i) {
		if (tlabel[i] == '^') {
      char func_letter;
      
			pos = i;
      func_letter = toupper(tlabel[i + 1]);
      if (func_letter >= 'A' && func_letter < 'Z') {
			  btn->hotkey = func_keys[func_letter - 'A'];
      }
			for (int j = i; j < strlen(tlabel); ++j) {
				tlabel[j] = tlabel[j + 1];
      }
		}
	}
	if      (strcmp(tlabel, "OK"    ) == 0) btn->altkey = OKALT;
	else if (strcmp(tlabel, "CANCEL") == 0) btn->altkey = CANCELALT;

	// Center and draw text on button.
  lc->setTextSize(2);
  lc->setTextWrap(true);
  lc->setTextColor(color_btn_text);
  int x = (wnd->ww / 2) - (strlen(tlabel) * CHAR_WIDTH_PIXELS / 2);
  lc->setCursor(x, 8);
  lc->print(tlabel);

	// Underline the hot-key character.
	if (pos >= 0) {
    lc->drawFastHLine(x + pos * CHAR_WIDTH_PIXELS, 18, CHAR_WIDTH_PIXELS-1, color_btn_text);
  }
}

void SetupButton(struct button_s *btn, int x, int y, const char *lbl) {
  int w;

  // make button wider to fit label
  w = strlen(lbl) * CHAR_WIDTH_PIXELS + 12;
  if (w < BUTTON_WIDTH_PIXELS) {
    w = BUTTON_WIDTH_PIXELS;
  }
  //SetupWindow(&btn->windw, x, y, w, BUTTON_HEIGHT_PIXELS/*h*/, 0/*brd*/, 1/*buf*/); // buffer not working on HX8357?
  SetupWindow(&btn->windw, x, y, w, BUTTON_HEIGHT_PIXELS/*h*/, 0/*brd*/, 0/*buf*/);

  if (lbl != NULL) {
    strncpy (btn->label_str, lbl, BUTTON_MAX_LABEL);
  } else { // lbl == NULL
    btn->label_str[0] = '\x0';
  }
  btn->label_str[BUTTON_MAX_LABEL-1] = '\x0'; // ensure null term.

  btn->altkey = 0;
  btn->hotkey = 0;

  btn->label_canvas = new GFXcanvas16(w-4, BUTTON_HEIGHT_PIXELS-4);
  DrawButtonLabelToCanvas (btn);
}

void DrawButton(struct button_s *btn, bool has_focus) {
  struct windw_s *wnd;
  wnd = &btn->windw;

  DrawWindow (wnd);

  if (wnd->buffered) {
    tft.drawRGBBitmap(wnd->wx+2,   wnd->wy+2, btn->label_canvas->getBuffer(),
                                              btn->label_canvas->width(),
                                              btn->label_canvas->height());
  } else { // !wnd->buffered
	  int pos = -1;                  // position in 'btn->label_str' where '^' was found
  	char tlabel[BUTTON_MAX_LABEL]; // copy of 'btn->label_str' with no '^' character

    // Find and remove the ^ character and
    // set the appropriate hot key.
    strncpy(tlabel, btn->label_str, BUTTON_MAX_LABEL);
    tlabel[BUTTON_MAX_LABEL-1] = '\x0';
    for (int i = 0; i < strlen(tlabel); ++i) {
      if (tlabel[i] == '^') {
        char func_letter;
        
        pos = i;
        func_letter = toupper(tlabel[i + 1]);
        if (func_letter >= 'A' && func_letter < 'Z') {
          btn->hotkey = func_keys[func_letter - 'A'];
        }
        for (int j = i; j < strlen(tlabel); ++j) {
          tlabel[j] = tlabel[j + 1];
        }
      }
    }
    if      (strcmp(tlabel, "OK"    ) == 0) btn->altkey = OKALT;
    else if (strcmp(tlabel, "CANCEL") == 0) btn->altkey = CANCELALT;

    // Center and draw text on button.
    tft.setTextSize(2);
    tft.setTextWrap(true);
    tft.setTextColor(color_btn_text);
    int x = (wnd->wx + wnd->ww / 2) - (strlen(tlabel) * CHAR_WIDTH_PIXELS / 2);
    tft.setCursor(x, wnd->wy+12);
    tft.print(tlabel);

    // Underline the hot-key character.
    if (pos >= 0) {
      tft.drawFastHLine(x + pos * CHAR_WIDTH_PIXELS, wnd->wy+20, CHAR_WIDTH_PIXELS-1, color_btn_text);
    }
  } // end else (!wnd->buffered)
  if (has_focus) {
    DrawBorder (&tft, wnd, border_focus);
  }
}

void ClickButton (struct button_s *btn) {
  struct windw_s *wnd;
  wnd = &btn->windw;

  // Shift the image on the button down and right
	// to simulate button movement.
  tft.drawRGBBitmap(wnd->wx+3,   wnd->wy+3, btn->label_canvas->getBuffer(),
                                            btn->label_canvas->width(),
                                            btn->label_canvas->height());

	// Draw the button’s borders so the
	// button appears to be pressed.
  DrawBorder (&tft, wnd, border_inset);

  // TODO: link to something the button knows.
#ifdef USE_MP3
  if (mp3_found) {
    //musicPlayer.startPlayingFile("/radio_gaga.mp3");
    // "Interrupt based playback currently does not work on ESP32 platforms."
    // Source: https://learn.adafruit.com/adafruit-music-maker-featherwing/library-reference
    // Music will start, but after it starts playing, then more input forces the processor to reboot.

    musicPlayer.playFullFile("/radio_gaga.mp3");
  }
#endif
}



