noisysouth/adaradio/rp2040_windw_adaradio/rp2040_windw_adaradio.ino
// ---------------------- Event to Control functions --------------------

void DrawCtrl(struct tab_ctrl_s *ctrl, bool has_focus) {
  switch (ctrl->ctrl_type) {
  case ctrl_button:
    DrawButton ((struct button_s *)ctrl->ctrl_obj, has_focus);
    break;
  case ctrl_edit:
    DrawEdit ((struct edit_s *)ctrl->ctrl_obj, has_focus);
    break;
  default: // other kind of control.
    break; //  do nothing.
  }
}

void OnKeyCtrl(struct tab_ctrl_s *ctrl, char kb_in) {
  switch (ctrl->ctrl_type) {
  case ctrl_button:
    break;
  case ctrl_edit:
    OnKeyEdit ((struct edit_s *)ctrl->ctrl_obj, kb_in);
    break;
  default: // other kind of control.
    break; //  do nothing.
  }
}

void UpdateCtrl(struct tab_ctrl_s *ctrl) {
  switch (ctrl->ctrl_type) {
  case ctrl_button:
    break;
  case ctrl_edit:
    UpdateEdit ((struct edit_s *)ctrl->ctrl_obj);
    break;
  default: // other kind of control.
    break; //  do nothing.
  }
}

struct windw_s *GetCtrlWindow(struct tab_ctrl_s *ctrl) {
  struct windw_s *ret = NULL;

  switch (ctrl->ctrl_type) {
  case ctrl_windw:
    ret = (struct windw_s *)ctrl->ctrl_obj;
    break;
  case ctrl_cap_windw:
    ret = &((struct cap_windw_s *)ctrl->ctrl_obj)->windw;
    break;
  case ctrl_cap_twindw:
    ret = &((struct cap_twindw_s *)ctrl->ctrl_obj)->cwindw.windw;
    break;
  case ctrl_button:
    ret = &((struct button_s *)ctrl->ctrl_obj)->windw;
    break;
  case ctrl_edit:
    ret = &((struct edit_s *)ctrl->ctrl_obj)->windw;
    break;
  default: // other kind of control.
    break; //  do nothing.
  }
  return ret;
}

void OnClickCtrl(struct tab_ctrl_s *ctrl) {
  if (!was_click) {
    haptic_click ();
  }
  was_click = true;

  switch (ctrl->ctrl_type) {
  case ctrl_button:
    ClickButton ((struct button_s *)ctrl->ctrl_obj);
    break;
  default: // other kind of control.
    break; //  do nothing.
  }
}



// ------------------- Edit control -------------------------

void SetupEdit (struct edit_s *edt, int x, int y, int text_max_chars, const char *text_default) {
  int w;

  if (text_max_chars > EDIT_MAX_TEXT-1) {
    text_max_chars = EDIT_MAX_TEXT-1;
  }
  edt->text_max_chars = text_max_chars;

  // make control wider to fit allowed chars (Alternative: horizontal scrolling)
  w = text_max_chars * CHAR_WIDTH_PIXELS + 15;
  if (w < EDIT_WIDTH_PIXELS) {
    w = EDIT_WIDTH_PIXELS;
  }
  //SetupWindow(&edt->windw, x, y, w, EDIT_HEIGHT_PIXELS/*h*/, 0/*brd*/, 1/*buf*/);
  SetupWindow(&edt->windw, x, y, w, EDIT_HEIGHT_PIXELS/*h*/, 0/*brd*/, 0/*buf*/); // no use for buffering this

  if (text_default != NULL) {
    strncpy (edt->text_str, text_default, EDIT_MAX_TEXT);
  } else { // text_default == NULL
    edt->text_str[0] = '\x0';
  }
  edt->text_str[EDIT_MAX_TEXT-1] = '\x0'; // ensure null term.

  edt->cursor_idx = strlen(edt->text_str);
  edt->cursor_blink_on = false;
  edt->cursor_blink_count = 0;
}

void DrawEdit (struct edit_s *edt, bool has_focus) {
  struct windw_s *wnd;
  wnd = &edt->windw;
  int tx, ty;

  tx = wnd->wx+9;
  ty = wnd->wy+9;

  DrawBorder(&tft, wnd, border_inset);

  tft.fillRect(wnd->wx+2, wnd->wy+2, wnd->ww-4, wnd->wh-4, color_edit_backgr);

  // Draw text in control.
  tft.setTextSize(2);
  tft.setTextWrap(true);
  tft.setTextColor(color_edit_text);
  tft.setCursor(tx, wnd->wy+9);
  tft.print(edt->text_str);
 
  if (has_focus) {
    DrawBorder(&tft, wnd, border_focus);
  }
}

void DrawEditCursor (struct edit_s *edt) {
  struct windw_s *wnd;
  wnd = &edt->windw;
  int tx, ty;
  uint16_t draw_erase_color; // cursor color or background color

  tx = wnd->wx+9;
  ty = wnd->wy+9;

  if (edt->cursor_blink_on) {
    draw_erase_color = color_edit_cursor; // draw
  } else { // !cursor_blink_on
    draw_erase_color = color_edit_backgr; // erase
  }
  tft.drawFastVLine(tx + edt->cursor_idx*CHAR_WIDTH_PIXELS-2, ty-2, CHAR_HEIGHT_PIXELS+2, draw_erase_color);
  tft.drawFastVLine(tx + edt->cursor_idx*CHAR_WIDTH_PIXELS-1, ty-2, CHAR_HEIGHT_PIXELS+2, draw_erase_color);

  edt->cursor_blink_count = 0; // wait before blinking again
}

void UpdateEdit (struct edit_s *edt) {
  edt->cursor_blink_count++;
  if (edt->cursor_blink_count > CURSOR_BLINK_COUNT) {
    edt->cursor_blink_on = !edt->cursor_blink_on;
    DrawEditCursor (edt);
  }
}

void DebugPrintChars(char *str) {
  int idx;

  idx = 0;
  while (str[idx] != '\x0') {
    Serial.print(idx);
    Serial.print(": '");
    Serial.print(str[idx]);
    Serial.print("', ");
    idx++;
  }
  Serial.print(idx);
  Serial.println(": NULL");
}

void OnKeyEdit (struct edit_s *edt, char kb_in) {
  int text_len;

  text_len = strlen (edt->text_str);
  if (kb_in == KEY_BACKSPACE) {
    if (edt->cursor_idx > 0) {
      //edt->text_str[text_len-1] = '\x0';

      // Move all characters
      //  FROM range: cursor_idx   ... text_len+1
      //    TO range: cursor_idx-1 ... text_len
      int src_idx, dst_idx;
      dst_idx = edt->cursor_idx-1;
      while (dst_idx <= text_len) {
        src_idx = dst_idx+1;
        edt->text_str[dst_idx] = edt->text_str[src_idx];
        dst_idx++;
      }
      edt->cursor_idx--;
      DrawEdit (edt, true);
      edt->cursor_blink_on = true;
      DrawEditCursor (edt);
    }
  }

  // insert a character
  if (kb_in >= MIN_PRINTABLE && kb_in <= MAX_PRINTABLE) {
    if (text_len < edt->text_max_chars) { // yes, enough room for more
      // Move all characters
      //  FROM range: cursor_idx   ... text_len
      //    TO range: cursor_idx+1 ... text_len+1
      int src_idx, dst_idx;
      src_idx = text_len;
      while (src_idx >= edt->cursor_idx) {
        dst_idx = src_idx+1;
        edt->text_str[dst_idx] = edt->text_str[src_idx];
        src_idx--;
      }
      edt->text_str[edt->cursor_idx] = kb_in; // user's character
      edt->cursor_idx++;
      DrawEdit (edt, true);
      edt->cursor_blink_on = true;
      DrawEditCursor (edt);
    }
  }

  if (kb_in == KEY_LEFT) {
    if (edt->cursor_idx > 0) {
      edt->cursor_blink_on = false;
      DrawEditCursor (edt);
      
      edt->cursor_idx--;

      edt->cursor_blink_on = true;
      DrawEditCursor (edt);
    }
  }
  if (kb_in == KEY_RIGHT) {
    if (edt->cursor_idx < text_len) {
      edt->cursor_blink_on = false;
      DrawEditCursor (edt);

