noisysouth/adaradio/rp2040_windw_adaradio/rp2040_windw_adaradio.ino
      edt->cursor_idx++;

      edt->cursor_blink_on = true;
      DrawEditCursor (edt);
    }
  }
}

// ------------------- Label control -------------------------

void SetupLabel (struct label_s *lbl, int x, int y, int text_max_chars, const char *text_default) {
  int w;

  if (text_max_chars > LABEL_MAX_TEXT-1) {
    text_max_chars = LABEL_MAX_TEXT-1;
  }
  lbl->text_max_chars = text_max_chars;

  // make control wider to fit allowed chars (Alternative: horizontal scrolling)
  w = text_max_chars * CHAR_WIDTH_PIXELS + 15;
  if (w < LABEL_WIDTH_PIXELS) {
    w = LABEL_WIDTH_PIXELS;
  }
  //SetupWindow(&lbl->windw, x, y, w, LABEL_HEIGHT_PIXELS/*h*/, 0/*brd*/, 1/*buf*/);
  SetupWindow(&lbl->windw, x, y, w, LABEL_HEIGHT_PIXELS/*h*/, 0/*brd*/, 0/*buf*/); // no use for buffering this

  if (text_default != NULL) {
    strncpy (lbl->text_str, text_default, LABEL_MAX_TEXT);
  } else { // text_default == NULL
    lbl->text_str[0] = '\x0';
  }
  lbl->text_str[LABEL_MAX_TEXT-1] = '\x0'; // ensure null term.
}

void DrawLabel (struct label_s *lbl, bool has_focus) {
  struct windw_s *wnd;
  wnd = &lbl->windw;
  int tx, ty;

  tx = wnd->wx+9;
  ty = wnd->wy+9;

  DrawBorder(&tft, wnd, border_inset);

  tft.fillRect(wnd->wx+2, wnd->wy+2, wnd->ww-4, wnd->wh-4, color_label_backgr);

  // Draw text in control.
  tft.setTextSize(2);
  tft.setTextWrap(true);
  tft.setTextColor(color_label_text);
  tft.setCursor(tx, wnd->wy+9);
  tft.print(lbl->text_str);
 
  //if (has_focus) {
  //  DrawBorder(&tft, wnd, border_focus);
  //}
}